/*
Navicat MySQL Data Transfer

Source Server         : Jared
Source Server Version : 50562
Source Host           : localhost:3306
Source Database       : water

Target Server Type    : MYSQL
Target Server Version : 50562
File Encoding         : 65001

Date: 2020-01-01 14:15:41
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for article
-- ----------------------------
DROP TABLE IF EXISTS `article`;
CREATE TABLE `article` (
  `a_id` int(11) NOT NULL AUTO_INCREMENT,
  `a_title` varchar(100) DEFAULT NULL COMMENT '文章标题',
  `a_username` varchar(100) DEFAULT NULL COMMENT '文章作者，唯一，对应user表的u_username',
  `a_article` text COMMENT '文章内容',
  `a_lasttime` varchar(50) DEFAULT NULL COMMENT '文章最后修改时间',
  `a_status` int(4) DEFAULT NULL COMMENT '文章状态：0已删除 1存在',
  PRIMARY KEY (`a_id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of article
-- ----------------------------
INSERT INTO `article` VALUES ('6', '水之赞', 'admin', '\n------------\n\n同学们，水不光构成了生命，还能帮助我们干很多事。比如说睡能帮助人们维持生命，洗衣服等，更另我们欣慰的是水还会给我们很多启示，因此，我欣赏它，赞美它。\n水能包容一切。每当我们把脏的小脸、小手放入那干净的清水中，手脸上的污垢全部都融入水中后，小手圆脸都变得干干净净，可是那一盆清水由干净变为肮脏了，但水却毫无怨言。水的胸襟真是宽广呀，它让我们也学会了包容。这不，我们同学之间的矛盾已很少了。\n水是无私奉献的。每当人或动物渴时，第一时间想到的就是水。水养活了无数生命，它牺牲自己却毫无怨言，默默无闻，从不要求任何回报，可见它的品格是多么高尚啊！我们的老师也是这样的，日复一日，年复一年，他们培养了无数人才，也没求任何回报。\n水是坚持不懈的。它柔软的身子骨，却能把坚硬的石头打穿。也能把有棱角的石头打磨的十分光滑。这难道是一时？一日？一月？就能完成的吗？这不正体现了水的坚持不懈吗？我们学子也是这样，只有坚持不懈的人，才会学有所成。\n水是一个普通而又不普通的东西，不仅是生命的源泉，还是我们的老师。它教会我们许许多多的知识，让我们懂得不少的道理，我们一定要珍惜水，让它永远鲜活，永不枯竭。 \n\n------------\n\n', '2019-12-09 13:57:58', '1');
INSERT INTO `article` VALUES ('7', '滴水不漏', 'admin', '　　水房的水龙头一直在滴水，即便是关得很紧，仍然走水。无奈，只得去传达室让楼管大爷来看一眼。大爷慢条斯理地晃悠到水房，把水阀流量开到最大，然后关紧，水还是不断地滴落，他又慢慢地往回推了水阀，说：“你看，这不就不走水喽！你们平时关的太紧，它滑丝了。这就跟人一样，弦绷得太紧，容易崩了！”\n\n　　楼管走后，我又试了一遍，关到最紧，再慢慢地回一下，真是不再走水了。慨叹万物皆有道理。有的时候，做事总是希望做得完美，像水龙头一样滴水不漏，然而往往会深陷在自我营造的一种不遗余力的泥潭中，这时候不妨后退一步，也许会达到最绝佳的境地。', '2019-12-09 18:10:08', '1');
INSERT INTO `article` VALUES ('8', '水的风韵', 'admin', '　　在塞外，如果能有一片可以称之为“湖”的水域，就显得尤其珍贵了。\n\n　　前几天下了一场大雨，红山湖就明显丰盈起来，有了烟波浩渺的感觉。相比平时，多了许多前来游玩的人。我也常常到那里去，流连、驻足，亲近水的芳泽，品味水的风韵。\n\n　　上游的河道漫长而委婉，河水顺着河道姗姗而来，在我的眼前铺展、抒怀。明亮得像一面刚刚擦拭过的镜子，将它所见的事物一一记忆，然后又一一呈现出来。人的视线一下子丰富了，也错觉了人间，天堂。\n\n　　湖水平静、优雅地坦呈着，纯净地湛蓝着，柔美地明媚着。岸边的花草，树木，高楼和天上悠闲的云朵，都被真切地定格在一张静止的底片上。真与假、虚与实、颠与倒遥遥相守，深情注视。\n\n　　一只漂亮的蝴蝶翩翩飞来，寻找昨日那朵野花，想重续未了的缠绵。不料想，却被平静的湖水欺骗，一头扎进水里，成为痴情的殉道者，化作折翅的花朵，飘落在如镜的水面上，暗自哭泣。几只刚刚在水边临镜梳妆的水鸟，拍着轻巧的翅膀，像一阵轻柔的风，像几瓣飘飞的花瓣，贴在水面上滑行。它们飘过来，又飞过去，想伸出尖细的利爪，从水里捞起那只殉情的蝴蝶，为它的痴情做最美丽的祭奠。然而，那折翅的蝴蝶却紧紧依附在花朵的倒影上，幻想成为一株水中的并蒂莲。捞起蝴蝶的残躯却无法唤回远去的芳魂，水鸟们风一样在水面上掠过，做无奈的飞，成了湖面上一首忧伤的抒情诗，打湿了人们的眼眸。\n\n　　蜻蜓与湖水有着不解的渊源，无论湖水是否丰盈浩渺，它都会扇动那双透明的羽翼，轻盈地在水面飞翔。每一次光临，湖水都心慌意乱。湖水可以平静地深沉，优雅地从容，可就是禁不起那小小蜻蜓轻轻点啄。被点破了的心事，一点一点扩散。那无辜的折了翅的蝴蝶，被那细细的涟漪一波一波推向湖的深处，消失在视线之外。\n\n　　蝴蝶之殇不在于太过痴情，是在于情非所托，所托非时。不是来得太早，就是来得太迟，总是错过最佳的机缘。湖水的平静并非心无波澜，而是心早有所属。蝴蝶投水而殁，怨不得湖水的沉默无情。蝴蝶是花朵前世今生的情人，所以，折翅为朵，虽香魂飘落也是如此凄美;而蜻蜓才是湖水的宿命，只是那么轻盈一点，再平静，再深沉的湖水都会为之震颤，为之倾情。\n\n　　水的风韵在于静，静得深沉，静得大度、从容。它从遥远而来，它以潺潺的姿态而来，浩瀚成一片宽广的胸怀。无论多么喧哗的溪水，无论多么桀骜的河流，汇入它的怀抱，都会从容起来，认真思考水的前世今生，水的去处和归来;无论是深谷的流水，还是高山的飞泉，投入它的怀抱，都会沉静下来，以包容的姿态静默，用慈祥的目光关爱;无论是污浊的泥水，还是裹沙河流，融入它的怀抱，都会澄澈起来，纯净起来。在深沉的平静中，着眼未来。\n\n　　风生水起，水和风是亦敌亦友的冤家。风见不得一平如镜的湖水在那里沉思，深邃。将风徐徐吹来，湖水皱起眉头，心情难再平静。\n\n　　远处河道上的水荡漾起来，荡起了一层一层的波浪。愈加有力的风推着一排一排的波浪顺流而下，汹涌着，涌进湖里。整个湖面躁动不安了，你拥我挤，在湖里汹涌着，呜咽着。狂躁的湖水拍打着堤坝，企图想寻找一个可以突围的缺口，可是，很快就失望了。愤怒的湖水无奈地退回来，喘息着，重新编队，准备做拼死一搏。\n\n　　湖面荡起了水雾，迷茫而苍凉。波涛一排排涌起，一浪驱赶着一浪向着堤坝涌去。整个湖面震颤起来，咆哮起来。这是我见过的最为勇敢、无畏的队伍，这是我见过的最为壮观的场面。那一排一排的波浪是那么整齐，步伐是那么坚定有力，一排一排的波浪相互鼓励着，支持着席卷而来。后一排积蓄着力量，前一排迅疾扑上去，一排推动着一排，一排追赶着一排。就这样传递着、鼓动着、汹涌着、澎湃着……“哗”高高跃起的波浪狠狠地砸在堤坝上，摔得粉身碎骨，浪花四溅。那些飞溅的浪花有的成为泡沫，随风而逝;有的被摔向堤坝的深处，迅速被泥沙和杂草吞没;更多的则迅速退回来，汇入新的方队，重新投入战斗。不见丝毫慌乱，没有一点迟疑。前一排被粉碎了，后一排立刻扑上来，前仆后继，源源不断。堤坝的上空水雾弥漫，浪花四溅。这是一场殊死的战斗，每一朵浪花都愤怒地呐喊，每一滴湖水都在激昂地飞溅，整个湖面沸腾了，战栗了。\n\n　　岸边的人惊恐地目睹了这一切。衣服被狂风撕扯着，像一面面被战火炸毁的旗帜，在身边猎猎作响。湿漉漉的长发随风扬起，像干枯的树枝，随时都有折断的危险。全身都湿透了，整个身体被风压制在岸边的护栏上，动不得，不敢挪。屏住呼吸，看一场水的表演。\n\n　　风停了，湖水重归平静。顺着湖面望去，湖面恢复了原来那一平如镜的样子。只有堤坝的边上，还存留一些白色的泡沫，那是一场战斗的痕迹。那些曾经激情四射的浪花，都重新融入湖水里，安静地蓝，优雅地铺展。\n\n　　水是至柔至刚，至静至动的，水的风韵在于它的因势赋形，以柔柔的姿态坚定地前进。这是我们人所无法比拟的，因此古人常常喟叹曰“仁者乐山，智者乐水。”水是充满智慧和灵性的，它的一静一动，隐逸或者奔腾，都含有智慧和哲理。让我们每一个亲临它的人都会有所启迪和感悟。\n\n　　水的风韵在于它的静，静得那么优雅深邃;水的风韵在于它动，动起来又是那么激情四射汹涌澎湃;水的风韵还在于动静之间的从容、优雅、果敢和充满了智慧;水的风韵在于我们现在还能随时随地的欣赏，随时随地的亲近。如果有那一天我们再无法亲近水的芳泽，再无法欣赏水的风韵，我们将如何呢？我无法想象。\n\n　　水的智慧在于它的柔韧、坚定，在于它总是会以各种有效的方式达到自己的目的。但它的智慧还不足以主宰自己的命运，不足以决定自己的去留、存在或者消失。决定水的命运的还是我们人类。我们以闲适的心境欣赏水的风韵的时候，在那片宝贵的水域在我们的眼前平静地深沉，或激情澎湃的时候，我们真应该沉静下来想一想，我们如此欣赏水的智慧，那么我们的智慧在哪里呢？\n\n　　因为随处可见，所以我们大多数人视而不见。因为到处都有，我们司空见惯，就忘记了去品味，去关注。当哪一天我们想起去欣赏水的风韵的时候，会突然发现，水已经成为了稀缺的东西，就像我们的血液那样不可多得，不可或缺。我们就无法也不会有什么雅兴去欣赏水的风韵了。', '2019-12-10 18:13:20', '1');
INSERT INTO `article` VALUES ('9', '观水', 'admin', '　　南去的一江沱水，是流动沧桑的眼睛，生命如水，好一分亘古的诗意。不知自何而始从雪山的绝顶，从东方之圣山，一股激流的震慑，一股力量的飞腾：生命，由此而出，竟是如此的恢弘，如此的灿烂。\n\n　　海纳百川，有容乃大;壁立千仞，无欲则刚。有人颓然长叹：人生百年，草木一秋。有人感慨万千：逝者如斯，一去不返。然而，千万座山峰貌似坚硬，却经不住风沙的年年侵蚀，唯有水包罗万象，笑视一切，生命由此而发扬而宏伟。\n\n　　水去水生，是水对生命的责任。\n\n　　万涓成水，终究汇流成河，像一首澎湃的歌。有人不解：水之东去，何处归宿？有人疑惑：水之行程，何处方歇？然而，流动的生命泻出不尽的诗意，唯有流动之水，行吟百物，容纳万象，生命由此丰满。好个“容纳”，水的责任尽在其中！\n\n　　有人在现实中迷失，于是，水流的静谧酿造成奔腾的激情，流去的不止演变成向前的坚定，水就是生命之歌。有人在生活中领悟，于是，水的柔韧升华成宽容的博大，水的宁静升华成不屈的精神，水就是生命之灵。\n\n　　苏轼观水，谁道人生无再少，门前流水尚能西，世人但恐韶关易去，东坡独看到生命如水的不竭;大江东去，浪淘尽，千古风流人物，世人但慕荣华名利，东坡独看到生命如水的洒脱：沧海可寄余生，世人但知红尘的繁华，东坡独看到生命如水的清纯。水流过了历史，也流过了苏轼，他用豪迈诠释了水的责任。\n\n　　李白观水，黄河之水天上来，奔流到海不复回，世人但知黄河的浑浊，李白独看到生命如水的激越;人生在世不如意，明朝散发弄扁舟，世人但知俗世的喧嚣，李白独看到生命如水的清高;长风破浪会有时，直挂云帆济沧海，世人但知高山险阻，李白独看到生命如水的顽强。水在历史中流过，李白用洒脱来诠释水的责任。\n\n　　水，看似平凡而弱小，然而它却依然为生命行吟，谱生命如华章飞歌。生命如水，水似生命，生命就是在这奔腾不息、日夜传递的责任之中闪烁出理性的光辉。\n\n　　观水，水因你而澎湃。\n', '2019-12-10 18:14:51', '0');
INSERT INTO `article` VALUES ('10', '水', 'admin', '　　生活本如一渠清水，清清的，淡淡的。不要壮阔起伏的波澜，那样会使人疲于奔命;不要五彩斑斓的色彩，那样只能给人以海市蜃楼般的虚幻。\n\n　　人生的轨迹并非总如预设的一般，朝心仪的方向驰往。你需要一颗清静如渠的心来从容淡定地面对未知的情况。\n\n　　文革期间，画家黄永玉与作家沈从文于下放途中擦肩而过。沈从文先生淡淡地告诉黄永玉：“要从容。”十年动乱过去，黄永玉说那三个字总会在其心间不经意地浮现。\n\n　　的确，这是一种多么淡定豁达的生活态度啊！如水一般清澈，如水一般坚定，永不止息。那是一种“一片冰心在玉壶”的淡定！\n\n　　古语有云：“君子之交淡如水”可见在处理人际关系中，水也是一种衡量标准，而且是很高的标准。\n\n　　君子之求，不因名利，不因富贵。庄子曰：“不为冠冕而肆志，不为穷约而趋俗。”孔子曰：“君子和而不同，君子周而不比。”如水之交，不需要铜臭搅混它。与人交往，先哲已给我们树立榜样，伯牙子期高山流水遇知音，诗人李白以诗会友互表敬意。\n\n　　与人的交往，也如水一般清澈，一般和谐，一般温润。和谐以共生共荣。\n\n　　清水一直以来都是整个中华民族精神的代表符号。\n\n　　五月地震，四川震区牵动全国人民的心。人们默默地为灾区人民祈祷，无私地贡献自己的绵薄之力。我们记不清每一位救援者的名字，我们记不清每一位捐款者的名字，我们记不清第一位医务工作者的名字，但我们知道，他们有爱，有对生命的敬重，有对国家的赤诚！大爱无痕，大爱如水，滋润却无声。\n\n　　渠清如许，这是一个人的处世态度，是与人交往的准则，更是为国家民族奉献的最高境界。\n\n　　没有波澜，没有色彩，只有如水的静默，那即是一种对生活的最高敬意。', '2019-12-11 18:17:05', '1');
INSERT INTO `article` VALUES ('11', '那泓清泉在叮咚作响。', 'admin', '　　是什么轻轻滑过心头，常年送来清凉的慰藉？是什么柔柔流过心间，深情奏响动人的摇曲？又是什么静静涤荡心灵，给人以清新的意蕴？是你呵，语文，我心中的一泓清泉。把心香焚起，心灯点亮，听，那泓清泉在叮咚作响。\n\n　　**听，泉水叮咚，让我领略游览之趣。**\n\n　　“江南可采莲，莲叶何田田。”汉乐府用她独特的袅娜伴着莲花的点点清香，带着燕语的呢喃，夹着氤氲的水汽飘入人们的梦中，那梦境亦幻亦真，薄薄的白雾沾着水汽打湿了人们心中易感动的心，让人陶醉在这片江南丽景中。\n\n------------\n\n\n　　“水光潋滟晴方好，山色空蒙雨亦奇。”西湖丽景，闻名遐迩。晴日好，里日照碧水，碧水映蓝天。水面清圆，一一风荷举。山也罢，谁也罢，朦朦胧胧中牵动你的心扉，隐隐约约中沁入你的心脾，时明时暗中契合你的心意。西湖似西子，淡妆浓抹总相宜。\n\n>　　听，泉水叮咚，让我体会点滴真情。\n\n　　“十年生死两茫茫，不思量，自难忘，千里孤坟，无处话凄凉。”十年，这是一段多么久远的日子，纵使生死相隔，阴阳两界，剪不断的是苏轼对亡妻的无尽思念。真正的爱情经历了岁月的洗礼，不但没有被时间风华，反而似一杯佳酿，让人久久回味。这份真爱对于当今社会那些处于虚伪的感情生活中的人们，那更是一种不可小觑的心灵感动。\n\n　　“桃花潭水深千尺，不及汪伦送我情。”临别时，悠扬的笛声飘来，带着桃花的点点清香飘入李白的心中。在那份深深的友情面前，潭水的千尺任然望尘莫及。在铜臭味十足的今天，在这个充满冷漠与戒备的今天，人之一生，能有多少能够经得住岁月考验的知己？知己难得，我们应该好好地珍惜每一份友谊，用真诚去浇灌友谊的花朵。\n\n　　听，泉水叮咚，让我领悟人生之理。\n\n　　“眼中只有鱼和鹿的人，是看不见山和水的；眼中只有偶像的人，永远看不见真自我”刘墉《偶像》中的这句名言，对于当今一些疯狂的追星族，无疑是有力的一击。人的眼睛一旦被偶像蒙蔽，就无法发现自我的性灵，就像渔人和猎人的眼睛一旦被眼前的事物所蒙蔽，就不会发现风景这边独好一样。我们做人，活出性灵，展现出自己的独特价值，才能创造出自己的辉煌。\n\n　　“长风破浪会有时，直挂云帆济沧海。”人生不是一帆风顺的，磕磕碰碰在所难免。面对挫折，我们不能一味的抱怨，而要坦然地面对。阳光总在风雨后，不经历风雨怎么见彩虹？罗曼罗兰说：“人生是一条长绳，走在上面，你要微笑”。是啊，只有乐观地面对一切，才能战胜困难，抵达成功的彼岸。\n\n　　如果心如是一方小池，语文便是一泓清泉，缓缓而入，叮咚作响，给以我真趣，赋予我真情，教以我真理，此际，心清如许。贾平凹说得好，“人生得也罢，失也罢，要紧的是心中的一泓清泉里不能没有月辉”。如果说语文是我心中的一泓清泉，那么那份真趣、那份真情、那份真理就如那皎皎月辉，照亮我的人生路。\n\n　　浮泛在爱与梦的泉流上，我侧耳倾听语文这泓清泉最清越的声音：叮咚，叮咚……', '2019-12-12 15:47:03', '1');
INSERT INTO `article` VALUES ('14', '水是流动的灵魂', 'admin', '古语有云：\"仁者乐山，智者乐水。\"\n\n水是流动的灵魂，水清澈无垠。智者乐水，是爱于水的淡泊，爱于水的澄净。人的深谙、智慧，也只有在如水的淡泊中，方能显现。\n\n渔民，生活在海边的这群人们，深受着海水的濯洗，过的是常人眼中单调的打渔生活。然而，渔民们在无垠的海上，被滔天的海浪磨砺着，被大海广阔的胸襟陶冶着，活得是那么简单，却又是那么质朴。我母亲小的时候也是生活在海边的，儿时海边的回忆，总是令她无法忘怀：大海总能带给那群善良、质朴、淡泊的劳动者以简单的快乐。于是我爱海和渔民了，爱他们寻找着一份淡泊。\n\n也许你认为渔民算不上智者，但我认为享受简单，远离复杂，享受朴实，远离功利，这就是淡泊给予他们智慧，纯粹的无杂质的水赋予的生活之道。\n\n由于淡泊名利，陶渊明选择隐居，远离世俗，追求东篱饮酒、西畴放歌、南山采菊、桃源耕田的理想境界。杜甫深怀对百姓的同情以及对统治者的控诉，写下\"朱门酒肉臭，路有冻死骨\"的悲愤之句，却全然不在意自己的生活有多清苦，还拥有着\"安得广厦千万间，大庇天下寒士俱欢颜\"的博爱胸襟。\n\n他们，是智者，生活在淡泊中清苦里，骨子里却心比天高，有自己所满足的精神理想。这也正如水，看上去一无所有，却包容了万物，丰富的大千世界在其心中。\n\n袁隆平，淡泊名利，一介农夫，播撒智慧，收获富足。他，有着一颗为世界奉献的心，正如水有着赶走干旱、滋润绿地的渴望。\"喜看稻菽千重浪，最是风流袁隆平\"是对他最好的写照。\n\n渔民简单的生活，是如水的淡泊；隐者物我两忘，是如水的淡泊；像袁隆平一样播撒智慧、小视名利的人们，是如水的淡泊。', '2019-12-15 15:50:51', '1');
INSERT INTO `article` VALUES ('15', '小桥、流水、人家', 'admin', '　　家乡有许多美丽的景物，但最令我忘怀的是小桥、流水、还有人家。\n\n\n　　最令我想念的，非小桥莫属。春天，小桥四周开满了野花，绿草钻出地面，为大地增光添彩。夏天，鱼儿在河水中游弋着，嬉戏，玩耍，追逐，一派欢乐的景象。秋天的景象却有些不一样。桥边树林的落叶被风吹到桥上，犹如一只只生命即将凋零的蝴蝶，在空中不安地飘荡。一陈阵秋风吹来了，落叶又手拉手跳起了华尔兹。这萧杀的秋风，还有这片片落叶，构成了一幅截然不同的风景画。冬天雪花在天空中飞舞，给小桥盖上了一层厚厚的被。我最喜欢在桥上漫步了；在石头铺成的桥面上，欢快地走着，心情无比愉悦。\n\n\n　　其次就是流水了。如果说小桥给我们带来的是心情的愉悦，那么桥下的河，便是带来了实质的享受。捉鱼，是常见的事情，吃到一条条鲜鱼那嫩滑的鱼肉，从舌尖上偷偷躲着牙齿，却不小心跑到了喉咙处，有什么能比这更幸福呢？它能让我们游泳，扑到水中，身上尽感清凉，打水仗……那一个个欢快的名字，让人一听就想立刻去玩。还有什么比这更加清凉？小桥还能让我们打雪仗、滑冰……它的用处很多很多，这小小的一页纸哪能塞下？\n\n\n　　只可惜，小桥已变成了高科技的大桥，但它永比不过小桥。小河也早已成为人们的垃圾场，那清澈的水也早已不复存在。只有那人家，也还存在，但是，却也早已变了质……\n\n\n　　原来，人们个个善良纯朴，哪里有欺骗。但现在，家乡也被他们“污染”了，哪里有欢声笑语？\n\n\n　　爱护我们的家乡吧，乡亲们，否则，更多像我一样怀念的人会出现，你们也会后悔的！', '2019-12-16 15:51:37', '1');
INSERT INTO `article` VALUES ('16', '水之恩，以何报？', 'admin', '古人云，“滴水之恩，当涌泉相报。”就是说在你困难时帮助过你的，你就需要在别人危难时报答他。\n\n滴水之恩，何以报？春天阳光普照大地时，用温度回报了小河，让小河的冰层消逝，使它能够欢快地流淌。\n\n滴水之恩，何以报？夏天烈日炎炎，甘露用泪水回报了大地，让花朵开放得更加鲜艳，让荷花在浇水之后开放得灼灼其华，沁人心脾。\n\n滴水之恩，何以报？“落红不是无情物，化作春泥更护花。”经历了春风夏日，落花用身躯回报了养着自己的大地妈妈。\n\n滴水之恩，何以报？冬天寒风凛例，雪花飘落，万物皆“冬眠”，只有梅花孤霜傲雪，用梅花的香气来回报给人们……\n\n大白然皆如此，何若人也?\n\n当你穷困潦倒时，他向你伸出了援助之手；当你失意时，他为你开启了导航灯，指引着你；当你失败时，他为你铺垫了一块块基石，让你走向成功的阶梯；当你惆怅时，他为你带来了开心果；当你不幸时，他为你送来了幸福的青鸟；当你……然而，当他累倒下，生病躺下时，你，你又为他送去了什么，带去了什么？是冷漠，还是倍致的关怀?\n\n滴水之恩，你以何报?\n\n诸葛亮用自己的一生来回报了当初刘备的三顾茅庐的赏识；李密用忠心回报了君王的栽培与信任，用孝心回报了母亲的养育之恩；贝多芬用音乐的成就回报了父亲的鼓励与支持；当代歌手用声音和美妙的音乐回报了热爱和喜欢他的歌迷……他们都在回报。\n\n“感恩的心， 感谢命运……”一首诗道出了我们应当如何来回报，“滴水之恩”，是怀着一颗感恩的心来回报曾经帮助过我们的每一个人。\n\n希望小学的女孩怀着一颗感恩的心，记住了那旬真、善、美的话语一一“记住别人对自己的帮助，学会帮助别人。”\n\n丛飞节衣缩食，资助了178名贫困学生，而当他病倒时，却无一人去看望他，这些受助者没有怀着一颗感恩的心，没有记住古人的话：“滴水之恩，当涌泉相报。”但丛飞的事迹得到了全国乃至全世界的肯定与赞许。他的付出我们来报。试问那些受助者，你们以何报曾经帮助过你们的人，是冷漠吗?\n\n滴水之恩，以何报？用一颗真诚的、感恩的心来报；用你的关怀来报；泪水带来的失望，微笑送来的是关怀。因此用你一个甜甜的微笑来报。\n\n你一句关怀的话语，一个甜甜的微笑，一个关怀的拥抱，一个感恩的眼神……都是滴水之恩， 也都是涌泉之报。\n\n啊！只要人人都献出一点爱，世界将变成美好的人间。啊！只要人人怀着一颗感恩的心，我们就将知道滴水之恩，以何报?\n\n——“滴水之恩，以何报？”\n\n——“滴水之恩，以心报？”', '2019-12-16 15:52:02', '1');
INSERT INTO `article` VALUES ('19', '水', 'admin', '> **水是生命之源！**', '2019-12-23 16:23:14', '1');
INSERT INTO `article` VALUES ('20', 'haha ', 'admin', '## Asdasd', '2019-12-24 08:01:53', '1');

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `c_id` int(11) NOT NULL AUTO_INCREMENT,
  `c_username` varchar(100) DEFAULT NULL COMMENT '评论人',
  `c_comment` varchar(100) DEFAULT NULL COMMENT '评论内容',
  `c_createtime` varchar(50) DEFAULT NULL COMMENT '评论时间',
  `c_status` int(1) DEFAULT NULL COMMENT '文章状态：0已删除 1存在',
  `c_type` int(1) unsigned zerofill NOT NULL DEFAULT '0' COMMENT '类型：0文章1话题 默认为0',
  `a_id` int(11) NOT NULL COMMENT '文章Id',
  PRIMARY KEY (`c_id`)
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of comment
-- ----------------------------
INSERT INTO `comment` VALUES ('8', 'admin', 'Hello!!!!', '2019-12-18 14:19:55', '1', '0', '8');
INSERT INTO `comment` VALUES ('9', 'admin', 'Hello2!!!!', '2019-12-18 14:20:09', '1', '0', '8');
INSERT INTO `comment` VALUES ('10', 'admin', 'Hello2!!!!\n\n', '2019-12-18 14:20:57', '1', '0', '8');
INSERT INTO `comment` VALUES ('11', 'admin', 'Hello3!!!!\n\n', '2019-12-18 14:24:48', '1', '0', '8');
INSERT INTO `comment` VALUES ('12', 'admin', 'Hello4!!!!\n', '2019-12-18 14:25:29', '1', '0', '8');
INSERT INTO `comment` VALUES ('13', 'admin', 'Hello5!!!!\n', '2019-12-18 14:27:28', '1', '0', '8');
INSERT INTO `comment` VALUES ('14', 'admin', 'Hello6!!!!\n', '2019-12-18 14:28:24', '1', '0', '8');
INSERT INTO `comment` VALUES ('15', 'admin', 'Hello', '2019-12-18 14:28:50', '1', '0', '9');
INSERT INTO `comment` VALUES ('16', 'admin', 'Hello2', '2019-12-18 14:29:54', '1', '0', '9');
INSERT INTO `comment` VALUES ('26', 'admin', 'hello', '2019-12-19 09:11:17', '1', '1', '2');
INSERT INTO `comment` VALUES ('28', 'admin', 'hello', '2019-12-19 09:29:22', '1', '1', '3');
INSERT INTO `comment` VALUES ('29', 'admin', 'hello!', '2019-12-19 09:31:48', '1', '1', '4');
INSERT INTO `comment` VALUES ('30', 'admin', 'hello!!', '2019-12-19 09:32:14', '1', '1', '4');
INSERT INTO `comment` VALUES ('31', 'admin', 'hello2', '2019-12-19 09:34:15', '1', '1', '5');
INSERT INTO `comment` VALUES ('32', 'admin', 'aa', '2019-12-19 09:34:34', '1', '1', '5');
INSERT INTO `comment` VALUES ('33', 'admin', 'hello', '2019-12-19 09:35:50', '1', '1', '7');
INSERT INTO `comment` VALUES ('34', 'admin', 'hello3', '2019-12-19 09:36:16', '1', '1', '7');
INSERT INTO `comment` VALUES ('35', 'admin', '你好吖！！！', '2019-12-19 09:37:13', '1', '1', '2');
INSERT INTO `comment` VALUES ('36', 'admin', 'ni hao !', '2019-12-19 09:38:12', '1', '1', '2');
INSERT INTO `comment` VALUES ('37', 'admin', 'hello', '2019-12-19 09:49:43', '1', '1', '3');
INSERT INTO `comment` VALUES ('38', 'admin', '真好！！！', '2019-12-19 10:10:38', '1', '0', '6');

-- ----------------------------
-- Table structure for forum
-- ----------------------------
DROP TABLE IF EXISTS `forum`;
CREATE TABLE `forum` (
  `f_id` int(11) NOT NULL AUTO_INCREMENT,
  `f_title` varchar(100) DEFAULT NULL COMMENT '话题标题',
  `f_username` varchar(100) DEFAULT NULL COMMENT '话题所有者，唯一，对应user表的u_username',
  `f_createtime` varchar(50) DEFAULT NULL COMMENT '话题创建时间',
  `f_comment` int(11) DEFAULT NULL COMMENT '话题讨论数量，就是当前话题的所有讨论数',
  `f_status` int(11) DEFAULT NULL COMMENT '话题状态：0删除，1存在',
  PRIMARY KEY (`f_id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of forum
-- ----------------------------
INSERT INTO `forum` VALUES ('2', '上善若水，出水芙蓉？', 'admin', '2019-12-18 18:01:19', '3', '1');
INSERT INTO `forum` VALUES ('3', '水立方的实现', 'admin', '2019-12-19 08:11:44', '2', '1');
INSERT INTO `forum` VALUES ('4', '节约用水，水力发电', 'admin', '2019-12-19 08:11:55', '2', '1');
INSERT INTO `forum` VALUES ('5', '水是生命之源，请保护水资源！', 'admin', '2019-12-19 08:12:17', '2', '1');
INSERT INTO `forum` VALUES ('7', '水是生命之源，请保护水资源！2', 'admin', '2019-12-19 08:12:24', '2', '1');
INSERT INTO `forum` VALUES ('11', '今天我们一起来讨论一个关于水资源保护的话题', 'admin', '2019-12-19 10:03:38', '0', '1');
INSERT INTO `forum` VALUES ('12', '讨论水的保护问题！', 'admin', '2019-12-23 16:24:25', '0', '1');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `u_id` int(11) NOT NULL AUTO_INCREMENT,
  `u_username` varchar(100) DEFAULT NULL,
  `u_password` varchar(100) DEFAULT NULL,
  `u_email` varchar(50) DEFAULT NULL,
  `u_birthday` varchar(100) DEFAULT NULL,
  `u_city` varchar(30) DEFAULT NULL COMMENT '所在地',
  `u_status` int(4) DEFAULT NULL COMMENT '用户状态。0：锁定，1：可用',
  `u_role` int(4) DEFAULT NULL COMMENT '用户角色。0：普通用户，1：管理员',
  `u_img` varchar(100) DEFAULT NULL COMMENT '用户头像路径',
  PRIMARY KEY (`u_id`)
) ENGINE=InnoDB AUTO_INCREMENT=80 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', '123', 'jared.top@outlook.com', '1998-06-29', '重庆', '1', '1', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('2', 'ccc', 'cc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('3', 'chen', 'cc', '934556594@qq.com', '2007-12-05', '上海', '0', '0', 'image/e068bhCk5H0dGeBaYkPyE5sxseJZXO02.jpg');
INSERT INTO `user` VALUES ('5', 'xiaoxiao', 'sszz', 'aa@qq.com', '2019-12-24', '浙江', '0', '0', 'image/yDc7pmox01BbmKb4sAq5VvVGti0KH2AX.jpg');
INSERT INTO `user` VALUES ('48', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('53', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('54', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('55', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('56', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('57', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('58', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('59', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('60', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('61', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('62', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('63', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('64', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '0', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('65', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('66', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '0', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('67', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('68', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('69', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('70', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('71', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('72', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('73', 'ccc', 'ccc', 'ccc.top@outlook.com', '1999-01-03', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('74', 'a', 'aa', 'zxc@qq.com', '2019-12-17', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('75', 'aa', 'zxc', 'aaaaa@qq.com', '2019-12-12', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('76', '123', 'aa', 'azxc@qq.com', '2019-12-17', '浙江', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('77', 'asd', 'asd', 'zxc@qq.com', '2019-12-18', '重庆', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('78', 'test', 'aaa', '384888907@qq.com', '2019-12-20', '上海', '1', '0', 'img/avatar.jpg');
INSERT INTO `user` VALUES ('79', 'aaaa', 'asd123', '384888907@qq.com', '2019-12-31', '上海', '1', '0', 'img/avatar.jpg');
